```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.aws_organization.random_string.random: Refreshing state... [id=si38]
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=656889719924]
module.aws_organization.aws_organizations_account.account: Refreshing state...
module.serverless_api["example"].module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_logging.data.aws_region.current: Refreshing state... [id=us-east-1]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-09-06 12:42:17.673828149 +0000 UTC]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-09-06 12:42:17.704711076 +0000 UTC]
module.dns.module.dns["live"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/345cace1-2d73-4acc-a44f-d45752deb801]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_settings.settings: Refreshing state... [id=twevug835e-live-health/GET]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_settings.settings: Refreshing state... [id=fghfrn4x2b-nonlive-health/GET]
module.dns.aws_route53_delegation_set.main: Refreshing state... [id=N00248303TX9WWXC3DUAK]
module.aws_logging.aws_s3_bucket.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.dns.module.dns["live"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/2d620bca-b6a9-4c69-b045-9874dcbf5f30]
module.dns.module.dns["nonlive"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/8135d581-d413-41d4-986c-d9ce3a96a52a]
module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.dns.module.dns["nonlive"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/46955869-b3c7-4936-b463-5caea37eb3f5]
module.aws_logging.aws_kms_key.cloudtrail: Refreshing state... [id=f206c800-14d0-4612-86cd-bd6b80b2045e]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=2777606739]
module.aws_api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]
module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.dns.module.dns["live"].aws_route53_zone.zone: Refreshing state... [id=Z09171243VWGB0AD4XJAE]
module.dns.module.dns["nonlive"].aws_route53_zone.zone: Refreshing state... [id=Z09185361UA62H9QOZ65H]
module.aws_logging.aws_cloudtrail.cloudtrail: Refreshing state... [id=cloudtrail]
module.dns.module.dns["live"].aws_route53_record.verification_record["scaffold.ly"]: Refreshing state... [id=Z09171243VWGB0AD4XJAE__7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly._CNAME]
module.dns.module.dns["nonlive"].aws_route53_record.verification_record["scaffoldly.dev"]: Refreshing state... [id=Z09185361UA62H9QOZ65H__5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev._CNAME]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-nonlive]
module.aws_api_gateway.module.domain["live"].aws_api_gateway_domain_name.domain: Refreshing state... [id=api.scaffold.ly]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-live]
module.aws_api_gateway.module.domain["nonlive"].aws_api_gateway_domain_name.domain: Refreshing state... [id=api.scaffoldly.dev]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_rest_api.api: Refreshing state... [id=fghfrn4x2b]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_rest_api.api: Refreshing state... [id=twevug835e]
module.aws_api_gateway.module.domain["live"].aws_route53_record.api_record: Refreshing state... [id=Z09171243VWGB0AD4XJAE_api.scaffold.ly_A]
module.aws_api_gateway.module.domain["nonlive"].aws_route53_record.api_record: Refreshing state... [id=Z09185361UA62H9QOZ65H_api.scaffoldly.dev_A]
module.aws_logging.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.aws_logging.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_resource.health: Refreshing state... [id=iwx47u]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_resource.health: Refreshing state... [id=0dnh87]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.execution_group: Refreshing state... [id=API-Gateway-Execution-Logs_twevug835e/live]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.execution_group: Refreshing state... [id=API-Gateway-Execution-Logs_fghfrn4x2b/nonlive]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-twevug835e-DEFAULT_4XX]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-fghfrn4x2b-DEFAULT_4XX]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method.health_get: Refreshing state... [id=agm-twevug835e-iwx47u-GET]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method.health_get: Refreshing state... [id=agm-fghfrn4x2b-0dnh87-GET]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration.health_get: Refreshing state... [id=agi-fghfrn4x2b-0dnh87-GET]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration.health_get: Refreshing state... [id=agi-twevug835e-iwx47u-GET]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment: Refreshing state... [id=8ienzh]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment: Refreshing state... [id=21b3jl]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_stage.stage: Refreshing state... [id=ags-twevug835e-live]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_stage.stage: Refreshing state... [id=ags-fghfrn4x2b-nonlive]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_base_path_mapping.mapping: Refreshing state... [id=api.scaffoldly.dev/]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_base_path_mapping.mapping: Refreshing state... [id=api.scaffold.ly/]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_base_path_mapping.mapping must be replaced
-/+ resource "aws_api_gateway_base_path_mapping" "mapping" {
        api_id      = "twevug835e"
      + base_path   = "example" # forces replacement
        domain_name = "api.scaffold.ly"
      ~ id          = "api.scaffold.ly/" -> (known after apply)
        stage_name  = "live"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date  = "2020-09-06T12:35:42Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:656889719924:twevug835e/live" -> (known after apply)
      ~ id            = "21b3jl" -> (known after apply)
      ~ invoke_url    = "https://twevug835e.execute-api.us-east-1.amazonaws.com/live" -> (known after apply)
        rest_api_id   = "twevug835e"
        stage_name    = "live"
      + triggers      = (known after apply) # forces replacement
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration_response.health_get_response_200 will be created
  + resource "aws_api_gateway_integration_response" "health_get_response_200" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "iwx47u"
      + response_templates = {
          + "application/json" = jsonencode(
                {
                  + healthy = true
                }
            )
        }
      + rest_api_id        = "twevug835e"
      + status_code        = "200"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_response.health_get_response_200 will be created
  + resource "aws_api_gateway_method_response" "health_get_response_200" {
      + http_method = "GET"
      + id          = (known after apply)
      + resource_id = "iwx47u"
      + rest_api_id = "twevug835e"
      + status_code = "200"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_settings.settings will be destroyed
  - resource "aws_api_gateway_method_settings" "settings" {
      - id          = "twevug835e-live-health/GET" -> null
      - method_path = "health/GET" -> null
      - rest_api_id = "twevug835e" -> null
      - stage_name  = "live" -> null

      - settings {
          - cache_data_encrypted                       = false -> null
          - cache_ttl_in_seconds                       = 300 -> null
          - caching_enabled                            = false -> null
          - data_trace_enabled                         = false -> null
          - logging_level                              = "INFO" -> null
          - metrics_enabled                            = true -> null
          - require_authorization_for_cache_control    = true -> null
          - throttling_burst_limit                     = -1 -> null
          - throttling_rate_limit                      = -1 -> null
          - unauthorized_cache_control_header_strategy = "SUCCEED_WITH_RESPONSE_HEADER" -> null
        }
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_stage.stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "stage" {
        arn                   = "arn:aws:apigateway:us-east-1::/restapis/twevug835e/stages/live"
      ~ cache_cluster_enabled = false -> true
      + cache_cluster_size    = "0.5"
      ~ deployment_id         = "21b3jl" -> (known after apply)
        execution_arn         = "arn:aws:execute-api:us-east-1:656889719924:twevug835e/live"
        id                    = "ags-twevug835e-live"
        invoke_url            = "https://twevug835e.execute-api.us-east-1.amazonaws.com/live"
        rest_api_id           = "twevug835e"
        stage_name            = "live"
        tags                  = {}
        variables             = {}
      ~ xray_tracing_enabled  = false -> true

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = "$context.identity.sourceIp $context.identity.caller $context.identity.user [$context.requestTime] \"$context.httpMethod $context.resourcePath $context.protocol\" $context.status $context.responseLength $context.requestId"
        }
    }

  # module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.access_logs_group will be created
  + resource "aws_cloudwatch_log_group" "access_logs_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/apigateway/example-live-access-logs"
      + retention_in_days = 0
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_base_path_mapping.mapping must be replaced
-/+ resource "aws_api_gateway_base_path_mapping" "mapping" {
        api_id      = "fghfrn4x2b"
      + base_path   = "example" # forces replacement
        domain_name = "api.scaffoldly.dev"
      ~ id          = "api.scaffoldly.dev/" -> (known after apply)
        stage_name  = "nonlive"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date  = "2020-09-06T12:35:43Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:656889719924:fghfrn4x2b/nonlive" -> (known after apply)
      ~ id            = "8ienzh" -> (known after apply)
      ~ invoke_url    = "https://fghfrn4x2b.execute-api.us-east-1.amazonaws.com/nonlive" -> (known after apply)
        rest_api_id   = "fghfrn4x2b"
        stage_name    = "nonlive"
      + triggers      = (known after apply) # forces replacement
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration_response.health_get_response_200 will be created
  + resource "aws_api_gateway_integration_response" "health_get_response_200" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "0dnh87"
      + response_templates = {
          + "application/json" = jsonencode(
                {
                  + healthy = true
                }
            )
        }
      + rest_api_id        = "fghfrn4x2b"
      + status_code        = "200"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_response.health_get_response_200 will be created
  + resource "aws_api_gateway_method_response" "health_get_response_200" {
      + http_method = "GET"
      + id          = (known after apply)
      + resource_id = "0dnh87"
      + rest_api_id = "fghfrn4x2b"
      + status_code = "200"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_settings.settings will be destroyed
  - resource "aws_api_gateway_method_settings" "settings" {
      - id          = "fghfrn4x2b-nonlive-health/GET" -> null
      - method_path = "health/GET" -> null
      - rest_api_id = "fghfrn4x2b" -> null
      - stage_name  = "nonlive" -> null

      - settings {
          - cache_data_encrypted                       = false -> null
          - cache_ttl_in_seconds                       = 300 -> null
          - caching_enabled                            = false -> null
          - data_trace_enabled                         = false -> null
          - logging_level                              = "INFO" -> null
          - metrics_enabled                            = true -> null
          - require_authorization_for_cache_control    = true -> null
          - throttling_burst_limit                     = -1 -> null
          - throttling_rate_limit                      = -1 -> null
          - unauthorized_cache_control_header_strategy = "SUCCEED_WITH_RESPONSE_HEADER" -> null
        }
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_stage.stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "stage" {
        arn                   = "arn:aws:apigateway:us-east-1::/restapis/fghfrn4x2b/stages/nonlive"
      ~ cache_cluster_enabled = false -> true
      + cache_cluster_size    = "0.5"
      ~ deployment_id         = "8ienzh" -> (known after apply)
        execution_arn         = "arn:aws:execute-api:us-east-1:656889719924:fghfrn4x2b/nonlive"
        id                    = "ags-fghfrn4x2b-nonlive"
        invoke_url            = "https://fghfrn4x2b.execute-api.us-east-1.amazonaws.com/nonlive"
        rest_api_id           = "fghfrn4x2b"
        stage_name            = "nonlive"
        tags                  = {}
        variables             = {}
      ~ xray_tracing_enabled  = false -> true

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = "$context.identity.sourceIp $context.identity.caller $context.identity.user [$context.requestTime] \"$context.httpMethod $context.resourcePath $context.protocol\" $context.status $context.responseLength $context.requestId"
        }
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.access_logs_group will be created
  + resource "aws_cloudwatch_log_group" "access_logs_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/apigateway/example-nonlive-access-logs"
      + retention_in_days = 0
    }

Plan: 10 to add, 2 to change, 6 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

Releasing state lock. This may take a few moments...
\n\n0
```